{"meta":{"title":"Cernote","subtitle":"A journal for things I found interesting","description":null,"author":"AyuCerni","url":"http://cernote.co"},"pages":[{"title":"About","date":"2016-12-21T02:14:53.040Z","updated":"2016-12-21T02:14:53.040Z","comments":true,"path":"about/index.html","permalink":"http://cernote.co/about/index.html","excerpt":"","text":"I am a business analyst, working mostly for requirements, both business and software. I test application both functional and business process correctness. At the end, documentation await me. Pretty boring, but well sometimes I can fix one or two bugs and add one or two features when my developer team has difficulty regarding people size. I wrote not only in tech, but also in any kind of entertainment (music, movie, games, food), politics and finance, etc. So don’t expect this blog to be one of full-technical blog. I might post a project or two here, but most of my projects are private one :D. Sorry ‘bout that."},{"title":"Categories","date":"2016-12-20T09:01:54.398Z","updated":"2016-12-20T09:01:54.398Z","comments":true,"path":"categories/index.html","permalink":"http://cernote.co/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2016-12-20T09:01:54.401Z","updated":"2016-12-20T09:01:54.401Z","comments":true,"path":"tags/index.html","permalink":"http://cernote.co/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"I Use Vim","slug":"I-use-Vim","date":"2016-12-22T20:10:20.000Z","updated":"2016-12-22T21:36:36.044Z","comments":true,"path":"2016/12/23/I-use-Vim/","link":"","permalink":"http://cernote.co/2016/12/23/I-use-Vim/","excerpt":"All people have their favourite tools to write on. Such as Sublime, notepad++, Ms. Word, OneNote, iA Writer, WriteMonkey, and so on. But let’s face it, you can’t code at Ms. Word, OneNote, iA Writer and WriteMonkey. So as a coder, you always prefer an editor that can do everything for text object. Then finally you have notepad, notepad++, sublime, atom, textmate, or … Vim.","text":"All people have their favourite tools to write on. Such as Sublime, notepad++, Ms. Word, OneNote, iA Writer, WriteMonkey, and so on. But let’s face it, you can’t code at Ms. Word, OneNote, iA Writer and WriteMonkey. So as a coder, you always prefer an editor that can do everything for text object. Then finally you have notepad, notepad++, sublime, atom, textmate, or … Vim. First time I hear about Vim was when I did my assignment using my friend’s laptop. He is a Vim user, he said Vim boost productivity. I don’t really care then since I prefer code at IDE than at text editor. I use text editor mainly to do some HTML or CSS. And yea, I used notepad++, just like all my friend at the college. But still, his word made me curious, so I try Vim. At first, I really use Vim because it looks cool (seriously). I don’t really care about productivity I gain by using Vim. In the end, I go back to VS because I mainly code C#. But some of Vim’s feature already engraved in my hand. I can’t leave HJKL’ navigation command and modal editing. Since I prefer typing more than moving my mouse, those features are really nice. Finally, I use VsVim at my VS to accommodate my need. I completely come back to Vim and make it my main editor last year. After completely fell in love with markdown. And I don’t like using any other editor that makes me leaves home row often. Vim is very comfortable for me. Right now, I still do the same as before, code light file that doesn’t need compiling at Vim, do most of my writing at Vim, and code C# at VS. I feel fine with that. And this year, I start to configuring my Vim to accommodate how I use it – Yea, I was using stock Vim. At the first, I use other people’s dotfile. I stumbled upon spf13’s vim configuration. Which lead me to lot of things Vim can become. Code completion, status bar, integrated git service, and solarized. But one thing that I realise after using his config is that I can’t freely customise the Vim to match my usage. And yes, at that time, I don’t understand how to configure Vim at all. VimL? Just heard it; separate .vimrc file? WTH is that? And so many things that make me realise I don’t even understand how my beloved text editor works. So I started to explore Vim’s configuration by learning spf13’s vim config. And finally, I can make my own configuration, not quite fancy, but already satisfying my current need. You can find my dotfiles here. I am happy with Vim for text object editing. But I still favour Visual Studio to code C# since … you know … IDE stuff. Complete feature gear for development. But for configuration file like .yaml; markup language like HTML and Markdown; and any other text object where all you need is a text editor, I goes to Vim. Vim is comfortable for my hand who hates to leave keyboard’s home row. I even use VsVim at Visual Studio. Since I seem to can’t let modal function and navigational key go away. After all, text editor is personal preference. No one can dictate anyone, because our definition of comfort and productivity are different. I am happy with Vim, my friend like VSCode better. Some of my friend still using Notepad++, and lot more using SublimeText2. It is not bad. Since I am more into typing than moving mouse, Vim is definitely my Ace. I was using notepad++, Sublime Text, atom, and bracket. But the one that I really comfortable in using is Vim.","categories":[{"name":"Tech","slug":"Tech","permalink":"http://cernote.co/categories/Tech/"}],"tags":[{"name":"Tools","slug":"Tools","permalink":"http://cernote.co/tags/Tools/"}]},{"title":"How to Assess Requirements [My Way] -- Part 1","slug":"How-to-assess-requirements-My-way","date":"2016-12-21T18:41:03.000Z","updated":"2016-12-22T19:33:22.673Z","comments":true,"path":"2016/12/22/How-to-assess-requirements-My-way/","link":"","permalink":"http://cernote.co/2016/12/22/How-to-assess-requirements-My-way/","excerpt":"I have been an analyst for almost 8 project within my first 2 years working as Business Analyst. Harsh truth, especially you need to do your job with minimum supervising, which left you alone to figure out how to make things work.","text":"I have been an analyst for almost 8 project within my first 2 years working as Business Analyst. Harsh truth, especially you need to do your job with minimum supervising, which left you alone to figure out how to make things work. And analyst is a front liner. They do things wrong, everything goes wrong from cost estimation to project timeline and from developer tasks to final product. So please be real cautious when you’re doing your job as analyst, especially for projects. After those projects, I found myself repeating same pattern over and over again. These pattern might be already described at several book or article of Requirement Engineering, but to be honest I don’t really pay attention to those book. I did read some of them, but there are some condition in real working world that just doesn’t work the same as those book, where you need to improvise all you can to ensure the safety of the project. So, here’s my how-to: How-to assess requirementsRead the Business Requirements … A lot!One thing that somehow missed by lot of people when building an application is, what this application will solve? What the use of features at this application. Understanding a Business Requirement is so important that you need to really understand what they need, NOT WHAT THEY WANT. Client tend to make requests, but always tight on budget, both money and time. So you need to make sure you will deliver thing they need. Because what they want somehow always need a more amount of money then they are willing to pay. Understanding business requirements of the application will also help you adjust the implementation of business process into your application. You can trim several process that is fancy but not necessary. Use ‘Use Case Method’ to simulate and analyse the business requirements. You’ll be happy. And it helps you negotiate with client. Remember that you need client approval to proceed, so if you really understand what kind of business they need you to solve, you can move into next part. Drive them into right solutionMost of the time, PM and BA consider saying ‘yes’ to each request asked by client. Sometimes you need to do that because those are exactly what client need, but lot of other time, you need to make a clear line that those feature they were asking will not make the application any better, instead of raising the cost they need to pay. I don’t hate fancy stuff, but I hate unnecessary stuff. If they need dinner than dinner it is, not a wedding cake. They’re different in usage, even tough they’re food all the same. Some fancy might be needed depends on the business requirement you try to solve. For example, they want all data create a history log when changed. With this, you will add a lot of work to developer, maintaining status, work with all field that call these data as lookup item, etc. But actually they don’t even need a history of changes because they business process don’t even mentioned the need of historical data. And almost no data will be updated since they all came from locked data. Depending on your understanding to business process and requirements, you will agree or object this request. So right after they finish talking about how their business works, take a deep breath, analyse them, and start steering your client into the planned solution direction. Don’t cut everything but don’t allow everything. Keep it balanced, you really need to understand thing they need and things the simply want. Keep communication until they signDon’t guess anything. This is their money, they have the right to know what they will get. So whenever you feel confused about one or two requirements, keep asking and confirming your client till they answer. Always throw the ball at them whenever you find difficulties. Discussion with your developerThis is important part. Sometimes our ego and feel of experienced is too high, we forgot to ask those who will work on this application. Especially if you have works on lot of project and has technical background in software industry. But it is worthy to ask your developer, so you can communicate client with more precise answer instead of guess. Developer team can help you find out how to implement the application. Software architect can help you find out what architecture is best for the solution. Discussion with developer team can becomes a powerful evidence to talk with client, instead of blabbering things about business process – which they own. Not a great plan. Next time, I will talk more about practical approach of requirement assessment, all things start with abstract and mentality. So first, you need to understand what they need and want, how they want it, steer them into your pace, and then Discuss with developer and keep communication to both parties, you can find it easier to translate the business requirements into software requirements. To be Continued","categories":[{"name":"Requirement Engineering","slug":"Requirement-Engineering","permalink":"http://cernote.co/categories/Requirement-Engineering/"}],"tags":[{"name":"Use Case Model","slug":"Use-Case-Model","permalink":"http://cernote.co/tags/Use-Case-Model/"},{"name":"Requirements","slug":"Requirements","permalink":"http://cernote.co/tags/Requirements/"},{"name":"Analysis","slug":"Analysis","permalink":"http://cernote.co/tags/Analysis/"},{"name":"How-to","slug":"How-to","permalink":"http://cernote.co/tags/How-to/"}]},{"title":"A Blog Life","slug":"A-blog-life","date":"2016-12-20T11:25:10.000Z","updated":"2016-12-22T03:29:26.277Z","comments":true,"path":"2016/12/20/A-blog-life/","link":"","permalink":"http://cernote.co/2016/12/20/A-blog-life/","excerpt":"I have stopped publishing my writing for … a year or something, last time I remember blogging is using Ghost, at c4rnote.xyz, the domain I just bought recently.","text":"I have stopped publishing my writing for … a year or something, last time I remember blogging is using Ghost, at c4rnote.xyz, the domain I just bought recently. But hell, who even able to resist the temptation of CLI controlled blogging, where you can just write everything within your Vim and then push it to the blog using command line? I am one of people that choose the more painful no GUI approach to use an application. Not that I am a super user or high level coder. I’m an analyst, always be, but I too am a coder, even tough I code less than analysing client’s demand. I hope this blog can live all forever because I of the great theme ‘icarus’ that I don’t even need to customise the theme further. When I use ghost, I spent more time dealing with themes than actually write something. If you find my writings and opinions are interesting, please do comment and give feedback to me. Thanks,","categories":[{"name":"Blabber","slug":"Blabber","permalink":"http://cernote.co/categories/Blabber/"}],"tags":[{"name":"Free Writing","slug":"Free-Writing","permalink":"http://cernote.co/tags/Free-Writing/"}]}]}